In [1]:
import numpy as np
import pandas as pd

In [9]:
arr1 = np.array([[10,20,np.nan],[5,np.nan,np.nan],[21,np.nan,10]])
arr1 = arr1.reshape(3, 3)
arr1

array([[10., 20., nan],
       [ 5., nan, nan],
       [21., nan, 10.]])

In [10]:
indexes = ["A", "B", "C"]
colomns = ["Colomn1", "Colomn2", "Colomn3"]

In [12]:
df = pd.DataFrame(arr1, indexes, colomns)
df

   Colomn1  Colomn2  Colomn3
A     10.0     20.0      NaN
B      5.0      NaN      NaN
C     21.0      NaN     10.0

In [20]:
df.index.names = [None]

In [22]:
df.size

9

In [28]:
df.dropna()

Empty DataFrame
Columns: [Colomn1, Colomn2, Colomn3]
Index: []

In [29]:
df.dropna(axis=1)

   Colomn1
A     10.0
B      5.0
C     21.0

In [32]:
df.dropna(thresh = 2)

   Colomn1  Colomn2  Colomn3
A     10.0     20.0      NaN
C     21.0      NaN     10.0

In [33]:
df.dropna(thresh = 3)

Empty DataFrame
Columns: [Colomn1, Colomn2, Colomn3]
Index: []

In [34]:
df.dropna(thresh = 2, axis = 1)

   Colomn1
A     10.0
B      5.0
C     21.0

In [36]:
df.fillna(value=0)

   Colomn1  Colomn2  Colomn3
A     10.0     20.0      0.0
B      5.0      0.0      0.0
C     21.0      0.0     10.0

In [41]:
df.sum()

Colomn1    36.0
Colomn2    20.0
Colomn3    10.0
dtype: float64

In [42]:
df.sum()

Colomn1    36.0
Colomn2    20.0
Colomn3    10.0
dtype: float64

In [51]:
df.sum(axis = 1)

A    30.0
B     5.0
C    31.0
dtype: float64

In [54]:
df.isnull()

   Colomn1  Colomn2  Colomn3
A    False    False     True
B    False     True     True
C    False     True    False

In [55]:
df.isnull().sum()

Colomn1    0
Colomn2    2
Colomn3    2
dtype: int64

In [56]:
True + True

2